; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	image3 - mode
	thermograph2 - mode
	image1 - mode
	thermograph0 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Planet4 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 image3)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon7)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 133)
	(supports instrument1 thermograph0)
	(supports instrument1 image1)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 104)
	(= (data Planet4 image3) 59)
	(= (data Phenomenon5 image3) 154)
	(= (data Phenomenon6 image3) 91)
	(= (data Phenomenon7 image3) 110)
	(= (data Planet4 thermograph2) 98)
	(= (data Phenomenon5 thermograph2) 178)
	(= (data Phenomenon6 thermograph2) 243)
	(= (data Phenomenon7 thermograph2) 140)
	(= (data Planet4 image1) 128)
	(= (data Phenomenon5 image1) 75)
	(= (data Phenomenon6 image1) 1)
	(= (data Phenomenon7 image1) 26)
	(= (data Planet4 thermograph0) 85)
	(= (data Phenomenon5 thermograph0) 271)
	(= (data Phenomenon6 thermograph0) 41)
	(= (data Phenomenon7 thermograph0) 227)
	(= (slew_time GroundStation2 GroundStation0) 18.1)
	(= (slew_time GroundStation0 GroundStation2) 18.1)
	(= (slew_time GroundStation2 GroundStation1) 2.264)
	(= (slew_time GroundStation1 GroundStation2) 2.264)
	(= (slew_time GroundStation3 GroundStation0) 53.62)
	(= (slew_time GroundStation0 GroundStation3) 53.62)
	(= (slew_time GroundStation3 GroundStation1) 7.804)
	(= (slew_time GroundStation1 GroundStation3) 7.804)
	(= (slew_time GroundStation3 GroundStation2) 3.901)
	(= (slew_time GroundStation2 GroundStation3) 3.901)
	(= (slew_time GroundStation1 GroundStation0) 60.46)
	(= (slew_time GroundStation0 GroundStation1) 60.46)
	(= (slew_time Planet4 GroundStation0) 33.18)
	(= (slew_time GroundStation0 Planet4) 33.18)
	(= (slew_time Planet4 GroundStation1) 51.93)
	(= (slew_time GroundStation1 Planet4) 51.93)
	(= (slew_time Planet4 GroundStation2) 53.4)
	(= (slew_time GroundStation2 Planet4) 53.4)
	(= (slew_time Planet4 GroundStation3) 30.92)
	(= (slew_time GroundStation3 Planet4) 30.92)
	(= (slew_time Phenomenon5 GroundStation0) 29.5)
	(= (slew_time GroundStation0 Phenomenon5) 29.5)
	(= (slew_time Phenomenon5 GroundStation1) 51.09)
	(= (slew_time GroundStation1 Phenomenon5) 51.09)
	(= (slew_time Phenomenon5 GroundStation2) 12.15)
	(= (slew_time GroundStation2 Phenomenon5) 12.15)
	(= (slew_time Phenomenon5 GroundStation3) 49.75)
	(= (slew_time GroundStation3 Phenomenon5) 49.75)
	(= (slew_time Phenomenon5 Planet4) 2.454)
	(= (slew_time Planet4 Phenomenon5) 2.454)
	(= (slew_time Phenomenon6 GroundStation0) 17.46)
	(= (slew_time GroundStation0 Phenomenon6) 17.46)
	(= (slew_time Phenomenon6 GroundStation1) 47.7)
	(= (slew_time GroundStation1 Phenomenon6) 47.7)
	(= (slew_time Phenomenon6 GroundStation2) 9.819)
	(= (slew_time GroundStation2 Phenomenon6) 9.819)
	(= (slew_time Phenomenon6 GroundStation3) 67.89)
	(= (slew_time GroundStation3 Phenomenon6) 67.89)
	(= (slew_time Phenomenon6 Planet4) 23.62)
	(= (slew_time Planet4 Phenomenon6) 23.62)
	(= (slew_time Phenomenon6 Phenomenon5) 9.689)
	(= (slew_time Phenomenon5 Phenomenon6) 9.689)
	(= (slew_time Phenomenon7 GroundStation0) 47.13)
	(= (slew_time GroundStation0 Phenomenon7) 47.13)
	(= (slew_time Phenomenon7 GroundStation1) 58.35)
	(= (slew_time GroundStation1 Phenomenon7) 58.35)
	(= (slew_time Phenomenon7 GroundStation2) 54.77)
	(= (slew_time GroundStation2 Phenomenon7) 54.77)
	(= (slew_time Phenomenon7 GroundStation3) 7.354)
	(= (slew_time GroundStation3 Phenomenon7) 7.354)
	(= (slew_time Phenomenon7 Planet4) 77.23)
	(= (slew_time Planet4 Phenomenon7) 77.23)
	(= (slew_time Phenomenon7 Phenomenon5) 28.16)
	(= (slew_time Phenomenon5 Phenomenon7) 28.16)
	(= (slew_time Phenomenon7 Phenomenon6) 76.96)
	(= (slew_time Phenomenon6 Phenomenon7) 76.96)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Planet4 image3)
	(have_image Phenomenon5 thermograph0)
	(have_image Phenomenon6 image1)
	(have_image Phenomenon7 image3)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 groundstation2 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 133 to 78.23, (fuel-used) from 0 to 54.77
   goals met: 0 of 4
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
3. (turn_to satellite0 groundstation3 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 78.23 to 74.329, (fuel-used) from 54.77 to 58.671
   goals met: 0 of 4
4. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 0 of 4
5. (turn_to satellite0 planet4 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet4)
   changed: (fuel satellite0) from 74.329 to 43.409, (fuel-used) from 58.671 to 89.591
   goals met: 0 of 4
6. (take_image satellite0 planet4 instrument0 image3)
   added: (have_image planet4 image3)
   changed: (data_capacity satellite0) from 1000 to 941, (data-stored) from 0 to 59
   goals met: 1 of 4
7. (turn_to satellite0 phenomenon5 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 43.409 to 40.955, (fuel-used) from 89.591 to 92.045
   goals met: 1 of 4
8. (turn_to satellite0 phenomenon7 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 40.955 to 12.795, (fuel-used) from 92.045 to 120.205
   goals met: 1 of 4
9. (turn_to satellite1 groundstation2 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 groundstation2)
   changed: (fuel satellite1) from 104 to 100.099, (fuel-used) from 120.205 to 124.106
   goals met: 1 of 4
10. (turn_to satellite1 phenomenon5 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon5)
   changed: (fuel satellite1) from 100.099 to 87.949, (fuel-used) from 124.106 to 136.256
   goals met: 1 of 4
11. (turn_to satellite1 phenomenon6 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon6)
   changed: (fuel satellite1) from 87.949 to 78.26, (fuel-used) from 136.256 to 145.945
   goals met: 1 of 4
12. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 4
13. (turn_to satellite1 phenomenon5 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon5)
   changed: (fuel satellite1) from 78.26 to 68.571, (fuel-used) from 145.945 to 155.634
   goals met: 1 of 4
14. (turn_to satellite1 phenomenon6 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon6)
   changed: (fuel satellite1) from 68.571 to 58.882, (fuel-used) from 155.634 to 165.323
   goals met: 1 of 4
15. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 1 of 4
16. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 4
17. (turn_to satellite1 phenomenon5 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon5)
   changed: (fuel satellite1) from 58.882 to 49.193, (fuel-used) from 165.323 to 175.012
   goals met: 1 of 4
18. (turn_to satellite1 groundstation2 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 groundstation2)
   changed: (fuel satellite1) from 49.193 to 37.043, (fuel-used) from 175.012 to 187.162
   goals met: 1 of 4
19. (turn_to satellite1 groundstation1 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 groundstation1)
   changed: (fuel satellite1) from 37.043 to 34.779, (fuel-used) from 187.162 to 189.426
   goals met: 1 of 4
20. (turn_to satellite1 groundstation2 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 groundstation2)
   changed: (fuel satellite1) from 34.779 to 32.515, (fuel-used) from 189.426 to 191.69
   goals met: 1 of 4
21. (turn_to satellite1 groundstation1 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 groundstation1)
   changed: (fuel satellite1) from 32.515 to 30.251, (fuel-used) from 191.69 to 193.954
   goals met: 1 of 4
22. (calibrate satellite1 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 1 of 4
23. (turn_to satellite1 groundstation2 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 groundstation2)
   changed: (fuel satellite1) from 30.251 to 27.987, (fuel-used) from 193.954 to 196.218
   goals met: 1 of 4
24. (turn_to satellite1 phenomenon5 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon5)
   changed: (fuel satellite1) from 27.987 to 15.837, (fuel-used) from 196.218 to 208.368
   goals met: 1 of 4
25. (take_image satellite1 phenomenon5 instrument1 thermograph0)
   added: (have_image phenomenon5 thermograph0)
   changed: (data_capacity satellite1) from 1000 to 729, (data-stored) from 59 to 330
   goals met: 2 of 4
26. (turn_to satellite1 phenomenon6 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon6)
   changed: (fuel satellite1) from 15.837 to 6.148, (fuel-used) from 208.368 to 218.057
   goals met: 2 of 4
27. (take_image satellite1 phenomenon6 instrument1 image1)
   added: (have_image phenomenon6 image1)
   changed: (data_capacity satellite1) from 729 to 728, (data-stored) from 330 to 331
   goals met: 3 of 4
28. (take_image satellite0 phenomenon7 instrument0 image3)
   added: (have_image phenomenon7 image3)
   changed: (data_capacity satellite0) from 941 to 831, (data-stored) from 331 to 441
   goals met: 4 of 4
